stm32duino/Arduino_Core_STM32/boards.txt
GenF1.menu.pnum.BLACKPILL_F103CB=BlackPill F103CB (or C8 with 128k)
GenF1.menu.pnum.BLACKPILL_F103CB.upload.maximum_size=131072
GenF1.menu.pnum.BLACKPILL_F103CB.upload.maximum_data_size=20480
GenF1.menu.pnum.BLACKPILL_F103CB.build.board=BLACKPILL_F103CB
GenF1.menu.pnum.BLACKPILL_F103CB.build.product_line=STM32F103xB
GenF1.menu.pnum.BLACKPILL_F103CB.build.variant_h=variant_PILL_F103XX.h
GenF1.menu.pnum.BLACKPILL_F103CB.build.variant=STM32F1xx/PILL_F103XX

# Generic STM32F103Cx boards
GenF1.menu.pnum.Generic_F103C4=Generic F103C4
GenF1.menu.pnum.Generic_F103C4.upload.maximum_size=16384
GenF1.menu.pnum.Generic_F103C4.upload.maximum_data_size=6144
GenF1.menu.pnum.Generic_F103C4.build.board=GENERIC_F103C4
GenF1.menu.pnum.Generic_F103C4.build.product_line=STM32F103x6
GenF1.menu.pnum.Generic_F103C4.build.variant=STM32F1xx/Generic_F103Cx

GenF1.menu.pnum.Generic_F103C6=Generic F103C6
GenF1.menu.pnum.Generic_F103C6.upload.maximum_size=32768
GenF1.menu.pnum.Generic_F103C6.upload.maximum_data_size=10240
GenF1.menu.pnum.Generic_F103C6.build.board=GENERIC_F103C6
GenF1.menu.pnum.Generic_F103C6.build.product_line=STM32F103x6
GenF1.menu.pnum.Generic_F103C6.build.variant=STM32F1xx/Generic_F103Cx

GenF1.menu.pnum.Generic_F103C8=Generic F103C8
GenF1.menu.pnum.Generic_F103C8.upload.maximum_size=65536
GenF1.menu.pnum.Generic_F103C8.upload.maximum_data_size=20480
GenF1.menu.pnum.Generic_F103C8.build.board=GENERIC_F103C8
GenF1.menu.pnum.Generic_F103C8.build.product_line=STM32F103xB
GenF1.menu.pnum.Generic_F103C8.build.variant=STM32F1xx/Generic_F103Cx

GenF1.menu.pnum.Generic_F103CB=Generic F103CB
GenF1.menu.pnum.Generic_F103CB.upload.maximum_size=131072
GenF1.menu.pnum.Generic_F103CB.upload.maximum_data_size=20480
GenF1.menu.pnum.Generic_F103CB.build.board=GENERIC_F103CB
GenF1.menu.pnum.Generic_F103CB.build.product_line=STM32F103xB
GenF1.menu.pnum.Generic_F103CB.build.variant=STM32F1xx/Generic_F103Cx

# Generic STM32F103Rx boards
GenF1.menu.pnum.Generic_F103R4=Generic F103R4
GenF1.menu.pnum.Generic_F103R4.upload.maximum_size=16384
GenF1.menu.pnum.Generic_F103R4.upload.maximum_data_size=6144
GenF1.menu.pnum.Generic_F103R4.build.board=GENERIC_F103R4
GenF1.menu.pnum.Generic_F103R4.build.product_line=STM32F103x6
GenF1.menu.pnum.Generic_F103R4.build.variant=STM32F1xx/Generic_F103Rx

GenF1.menu.pnum.Generic_F103R6=Generic F103R6
GenF1.menu.pnum.Generic_F103R6.upload.maximum_size=32768
GenF1.menu.pnum.Generic_F103R6.upload.maximum_data_size=10240
GenF1.menu.pnum.Generic_F103R6.build.board=GENERIC_F103R6
GenF1.menu.pnum.Generic_F103R6.build.product_line=STM32F103x6
GenF1.menu.pnum.Generic_F103R6.build.variant=STM32F1xx/Generic_F103Rx

GenF1.menu.pnum.Generic_F103R8=Generic F103R8
GenF1.menu.pnum.Generic_F103R8.upload.maximum_size=65536
GenF1.menu.pnum.Generic_F103R8.upload.maximum_data_size=20480
GenF1.menu.pnum.Generic_F103R8.build.board=GENERIC_F103R8
GenF1.menu.pnum.Generic_F103R8.build.product_line=STM32F103xB
GenF1.menu.pnum.Generic_F103R8.build.variant=STM32F1xx/Generic_F103Rx

GenF1.menu.pnum.Generic_F103RB=Generic F103RB
GenF1.menu.pnum.Generic_F103RB.upload.maximum_size=131072
GenF1.menu.pnum.Generic_F103RB.upload.maximum_data_size=20480
GenF1.menu.pnum.Generic_F103RB.build.board=GENERIC_F103RB
GenF1.menu.pnum.Generic_F103RB.build.product_line=STM32F103xB
GenF1.menu.pnum.Generic_F103RB.build.variant=STM32F1xx/Generic_F103Rx

GenF1.menu.pnum.Generic_F103RC=Generic F103RC
GenF1.menu.pnum.Generic_F103RC.upload.maximum_size=262144
GenF1.menu.pnum.Generic_F103RC.upload.maximum_data_size=49152
GenF1.menu.pnum.Generic_F103RC.build.board=GENERIC_F103RC
GenF1.menu.pnum.Generic_F103RC.build.product_line=STM32F103xE
GenF1.menu.pnum.Generic_F103RC.build.variant=STM32F1xx/Generic_F103Rx

GenF1.menu.pnum.Generic_F103RD=Generic F103RD
GenF1.menu.pnum.Generic_F103RD.upload.maximum_size=393216
GenF1.menu.pnum.Generic_F103RD.upload.maximum_data_size=65536
GenF1.menu.pnum.Generic_F103RD.build.board=GENERIC_F103RD
GenF1.menu.pnum.Generic_F103RD.build.product_line=STM32F103xE
GenF1.menu.pnum.Generic_F103RD.build.variant=STM32F1xx/Generic_F103Rx

GenF1.menu.pnum.Generic_F103RE=Generic F103RE
GenF1.menu.pnum.Generic_F103RE.upload.maximum_size=524288
GenF1.menu.pnum.Generic_F103RE.upload.maximum_data_size=65536
GenF1.menu.pnum.Generic_F103RE.build.board=GENERIC_F103RE
GenF1.menu.pnum.Generic_F103RE.build.product_line=STM32F103xE
GenF1.menu.pnum.Generic_F103RE.build.variant=STM32F1xx/Generic_F103Rx

GenF1.menu.pnum.Generic_F103RF=Generic F103RF
GenF1.menu.pnum.Generic_F103RF.upload.maximum_size=786432
GenF1.menu.pnum.Generic_F103RF.upload.maximum_data_size=98304
GenF1.menu.pnum.Generic_F103RF.build.board=GENERIC_F103RF
GenF1.menu.pnum.Generic_F103RF.build.product_line=STM32F103xG
GenF1.menu.pnum.Generic_F103RF.build.variant=STM32F1xx/Generic_F103Rx

GenF1.menu.pnum.Generic_F103RG=Generic F103RG
GenF1.menu.pnum.Generic_F103RG.upload.maximum_size=1048576
GenF1.menu.pnum.Generic_F103RG.upload.maximum_data_size=98304
GenF1.menu.pnum.Generic_F103RG.build.board=GENERIC_F103RG
GenF1.menu.pnum.Generic_F103RG.build.product_line=STM32F103xG
GenF1.menu.pnum.Generic_F103RG.build.variant=STM32F1xx/Generic_F103Rx

# Generic STM32F103Tx boards
GenF1.menu.pnum.Generic_F103T4=Generic F103T4
GenF1.menu.pnum.Generic_F103T4.upload.maximum_size=16384
GenF1.menu.pnum.Generic_F103T4.upload.maximum_data_size=6144
GenF1.menu.pnum.Generic_F103T4.build.board=GENERIC_F103T4
GenF1.menu.pnum.Generic_F103T4.build.product_line=STM32F103x6
GenF1.menu.pnum.Generic_F103T4.build.variant=STM32F1xx/Generic_F103Tx

GenF1.menu.pnum.Generic_F103T6=Generic F103T6
GenF1.menu.pnum.Generic_F103T6.upload.maximum_size=32768
GenF1.menu.pnum.Generic_F103T6.upload.maximum_data_size=10240
GenF1.menu.pnum.Generic_F103T6.build.board=GENERIC_F103T6
GenF1.menu.pnum.Generic_F103T6.build.product_line=STM32F103x6
GenF1.menu.pnum.Generic_F103T6.build.variant=STM32F1xx/Generic_F103Tx

GenF1.menu.pnum.Generic_F103T8=Generic F103T8
GenF1.menu.pnum.Generic_F103T8.upload.maximum_size=65536
GenF1.menu.pnum.Generic_F103T8.upload.maximum_data_size=20480
GenF1.menu.pnum.Generic_F103T8.build.board=GENERIC_F103T8
GenF1.menu.pnum.Generic_F103T8.build.product_line=STM32F103xB
GenF1.menu.pnum.Generic_F103T8.build.variant=STM32F1xx/Generic_F103Tx

