stm32duino/Arduino_Core_STM32/boards.txt
GenF1.menu.upload_method.dfuMethod=STM32CubeProgrammer (DFU)
GenF1.menu.upload_method.dfuMethod.upload.protocol=2
GenF1.menu.upload_method.dfuMethod.upload.options=-g
GenF1.menu.upload_method.dfuMethod.upload.tool=stm32CubeProg

GenF1.menu.upload_method.bmpMethod=BMP (Black Magic Probe)
GenF1.menu.upload_method.bmpMethod.upload.protocol=gdb_bmp
GenF1.menu.upload_method.bmpMethod.upload.tool=bmp_upload

GenF1.menu.upload_method.hidMethod=HID Bootloader 2.2
GenF1.menu.upload_method.hidMethod.upload.protocol=hid22
GenF1.menu.upload_method.hidMethod.upload.tool=hid_upload
GenF1.menu.upload_method.hidMethod.build.flash_offset=0x800
GenF1.menu.upload_method.hidMethod.build.bootloader_flags=-DBL_HID -DVECT_TAB_OFFSET={build.flash_offset}

GenF1.menu.upload_method.dfu2Method=Maple DFU Bootloader 2.0
GenF1.menu.upload_method.dfu2Method.upload.protocol=maple
GenF1.menu.upload_method.dfu2Method.upload.tool=maple_upload
GenF1.menu.upload_method.dfu2Method.upload.usbID=1EAF:0003
GenF1.menu.upload_method.dfu2Method.upload.altID=2
GenF1.menu.upload_method.dfu2Method.build.flash_offset=0x2000
GenF1.menu.upload_method.dfu2Method.build.bootloader_flags=-DBL_LEGACY_LEAF -DVECT_TAB_OFFSET={build.flash_offset}

GenF1.menu.upload_method.dfuoMethod=Maple DFU Bootloader original
GenF1.menu.upload_method.dfuoMethod.upload.protocol=maple
GenF1.menu.upload_method.dfuoMethod.upload.tool=maple_upload
GenF1.menu.upload_method.dfuoMethod.upload.usbID=1EAF:0003
GenF1.menu.upload_method.dfuoMethod.upload.altID=1
GenF1.menu.upload_method.dfuoMethod.build.flash_offset=0x5000
GenF1.menu.upload_method.dfuoMethod.build.bootloader_flags=-DBL_LEGACY_LEAF -DVECT_TAB_OFFSET={build.flash_offset}

################################################################################
# Generic F2
GenF2.name=Generic STM32F2 series

GenF2.build.core=arduino
GenF2.build.board=GenF2
GenF2.build.extra_flags=-D{build.product_line} {build.enable_usb} {build.xSerial}
GenF2.build.mcu=cortex-m3
GenF2.build.series=STM32F2xx
GenF2.build.cmsis_lib_gcc=arm_cortexM3l_math

# Generic F207ZCTx
GenF2.menu.pnum.GENERIC_F207ZCTX=Generic F207ZCTx
GenF2.menu.pnum.GENERIC_F207ZCTX.upload.maximum_size=262144
GenF2.menu.pnum.GENERIC_F207ZCTX.upload.maximum_data_size=131072
GenF2.menu.pnum.GENERIC_F207ZCTX.build.board=GENERIC_F207ZCTX
GenF2.menu.pnum.GENERIC_F207ZCTX.build.product_line=STM32F207xx
GenF2.menu.pnum.GENERIC_F207ZCTX.build.variant=STM32F2xx/F207Z(C-E-F-G)T_F217Z(E-G)T

# Generic F207ZETx
GenF2.menu.pnum.GENERIC_F207ZETX=Generic F207ZETx
GenF2.menu.pnum.GENERIC_F207ZETX.upload.maximum_size=524288
GenF2.menu.pnum.GENERIC_F207ZETX.upload.maximum_data_size=131072
GenF2.menu.pnum.GENERIC_F207ZETX.build.board=GENERIC_F207ZETX
GenF2.menu.pnum.GENERIC_F207ZETX.build.product_line=STM32F207xx
GenF2.menu.pnum.GENERIC_F207ZETX.build.variant=STM32F2xx/F207Z(C-E-F-G)T_F217Z(E-G)T

# Generic F207ZFTx
GenF2.menu.pnum.GENERIC_F207ZFTX=Generic F207ZFTx
GenF2.menu.pnum.GENERIC_F207ZFTX.upload.maximum_size=786432
GenF2.menu.pnum.GENERIC_F207ZFTX.upload.maximum_data_size=131072
GenF2.menu.pnum.GENERIC_F207ZFTX.build.board=GENERIC_F207ZFTX
GenF2.menu.pnum.GENERIC_F207ZFTX.build.product_line=STM32F207xx
GenF2.menu.pnum.GENERIC_F207ZFTX.build.variant=STM32F2xx/F207Z(C-E-F-G)T_F217Z(E-G)T

# Generic F207ZGTx
GenF2.menu.pnum.GENERIC_F207ZGTX=Generic F207ZGTx
GenF2.menu.pnum.GENERIC_F207ZGTX.upload.maximum_size=1048576
GenF2.menu.pnum.GENERIC_F207ZGTX.upload.maximum_data_size=131072
GenF2.menu.pnum.GENERIC_F207ZGTX.build.board=GENERIC_F207ZGTX
GenF2.menu.pnum.GENERIC_F207ZGTX.build.product_line=STM32F207xx
GenF2.menu.pnum.GENERIC_F207ZGTX.build.variant=STM32F2xx/F207Z(C-E-F-G)T_F217Z(E-G)T

# Generic F217ZETx
GenF2.menu.pnum.GENERIC_F217ZETX=Generic F217ZETx
GenF2.menu.pnum.GENERIC_F217ZETX.upload.maximum_size=524288
GenF2.menu.pnum.GENERIC_F217ZETX.upload.maximum_data_size=131072
GenF2.menu.pnum.GENERIC_F217ZETX.build.board=GENERIC_F217ZETX
GenF2.menu.pnum.GENERIC_F217ZETX.build.product_line=STM32F217xx
GenF2.menu.pnum.GENERIC_F217ZETX.build.variant=STM32F2xx/F207Z(C-E-F-G)T_F217Z(E-G)T

# Generic F217ZGTx
GenF2.menu.pnum.GENERIC_F217ZGTX=Generic F217ZGTx
GenF2.menu.pnum.GENERIC_F217ZGTX.upload.maximum_size=1048576
GenF2.menu.pnum.GENERIC_F217ZGTX.upload.maximum_data_size=131072
GenF2.menu.pnum.GENERIC_F217ZGTX.build.board=GENERIC_F217ZGTX
GenF2.menu.pnum.GENERIC_F217ZGTX.build.product_line=STM32F217xx
GenF2.menu.pnum.GENERIC_F217ZGTX.build.variant=STM32F2xx/F207Z(C-E-F-G)T_F217Z(E-G)T

# Upload menu
GenF2.menu.upload_method.swdMethod=STM32CubeProgrammer (SWD)
GenF2.menu.upload_method.swdMethod.upload.protocol=0
GenF2.menu.upload_method.swdMethod.upload.options=-g
GenF2.menu.upload_method.swdMethod.upload.tool=stm32CubeProg

GenF2.menu.upload_method.serialMethod=STM32CubeProgrammer (Serial)
GenF2.menu.upload_method.serialMethod.upload.protocol=1
GenF2.menu.upload_method.serialMethod.upload.options={serial.port.file} -s
GenF2.menu.upload_method.serialMethod.upload.tool=stm32CubeProg

GenF2.menu.upload_method.dfuMethod=STM32CubeProgrammer (DFU)
GenF2.menu.upload_method.dfuMethod.upload.protocol=2
GenF2.menu.upload_method.dfuMethod.upload.options=-g
GenF2.menu.upload_method.dfuMethod.upload.tool=stm32CubeProg

################################################################################
# Generic F3

GenF3.name=Generic STM32F3 series

GenF3.build.core=arduino
GenF3.build.board=GenF3
GenF3.build.extra_flags=-D{build.product_line} {build.enable_usb} {build.xSerial} {build.bootloader_flags}
GenF3.build.mcu=cortex-m4
GenF3.build.flags.fp=-mfpu=fpv4-sp-d16 -mfloat-abi=hard
GenF3.build.series=STM32F3xx
GenF3.build.cmsis_lib_gcc=arm_cortexM4lf_math

# BLACKPILL_F303CC
GenF3.menu.pnum.BLACKPILL_F303CC=RobotDyn BlackPill F303CC
GenF3.menu.pnum.BLACKPILL_F303CC.upload.maximum_size=262144
GenF3.menu.pnum.BLACKPILL_F303CC.upload.maximum_data_size=40960
GenF3.menu.pnum.BLACKPILL_F303CC.build.board=BLACKPILL_F303CC
GenF3.menu.pnum.BLACKPILL_F303CC.build.product_line=STM32F303xC
GenF3.menu.pnum.BLACKPILL_F303CC.build.variant_h=variant_PILL_F303XX.h
GenF3.menu.pnum.BLACKPILL_F303CC.build.variant=STM32F3xx/PILL_F303XX

# Upload menu
GenF3.menu.upload_method.swdMethod=STM32CubeProgrammer (SWD)
GenF3.menu.upload_method.swdMethod.upload.protocol=0
GenF3.menu.upload_method.swdMethod.upload.options=-g
GenF3.menu.upload_method.swdMethod.upload.tool=stm32CubeProg

GenF3.menu.upload_method.serialMethod=STM32CubeProgrammer (Serial)
GenF3.menu.upload_method.serialMethod.upload.protocol=1
GenF3.menu.upload_method.serialMethod.upload.options={serial.port.file} -s
GenF3.menu.upload_method.serialMethod.upload.tool=stm32CubeProg

GenF3.menu.upload_method.dfuMethod=STM32CubeProgrammer (DFU)
GenF3.menu.upload_method.dfuMethod.upload.protocol=2
GenF3.menu.upload_method.dfuMethod.upload.options=-g
GenF3.menu.upload_method.dfuMethod.upload.tool=stm32CubeProg

GenF3.menu.upload_method.bmpMethod=BMP (Black Magic Probe)
GenF3.menu.upload_method.bmpMethod.upload.protocol=gdb_bmp
GenF3.menu.upload_method.bmpMethod.upload.tool=bmp_upload

################################################################################
# Generic F4

