stm32duino/Arduino_Core_STM32/boards.txt
GenF4.name=Generic STM32F4 series

GenF4.build.core=arduino
GenF4.build.board=GenF4
GenF4.build.extra_flags=-D{build.product_line} {build.enable_usb} {build.xSerial} {build.bootloader_flags}
GenF4.build.mcu=cortex-m4
GenF4.build.flags.fp=-mfpu=fpv4-sp-d16 -mfloat-abi=hard
GenF4.build.series=STM32F4xx
GenF4.build.cmsis_lib_gcc=arm_cortexM4lf_math

# Black F407VE
# https://github.com/mcauser/BLACK_F407VEZ
GenF4.menu.pnum.BLACK_F407VE=Black F407VE
GenF4.menu.pnum.BLACK_F407VE.upload.maximum_size=524288
GenF4.menu.pnum.BLACK_F407VE.upload.maximum_data_size=131072
GenF4.menu.pnum.BLACK_F407VE.build.board=BLACK_F407VE
GenF4.menu.pnum.BLACK_F407VE.build.product_line=STM32F407xx
GenF4.menu.pnum.BLACK_F407VE.build.variant_h=variant_BLACK_F407XX.h
GenF4.menu.pnum.BLACK_F407VE.build.variant=STM32F4xx/BLACK_F407XX

# Black F407VG
# https://github.com/mcauser/BLACK_F407VEZ with bigger chip
GenF4.menu.pnum.BLACK_F407VG=Black F407VG
GenF4.menu.pnum.BLACK_F407VG.upload.maximum_size=1048576
GenF4.menu.pnum.BLACK_F407VG.upload.maximum_data_size=131072
GenF4.menu.pnum.BLACK_F407VG.build.board=BLACK_F407VG
GenF4.menu.pnum.BLACK_F407VG.build.product_line=STM32F407xx
GenF4.menu.pnum.BLACK_F407VG.build.variant_h=variant_BLACK_F407XX.h
GenF4.menu.pnum.BLACK_F407VG.build.variant=STM32F4xx/BLACK_F407XX

# Black F407ZE
# https://github.com/mcauser/BLACK_F407ZE
GenF4.menu.pnum.BLACK_F407ZE=Black F407ZE
GenF4.menu.pnum.BLACK_F407ZE.upload.maximum_size=524288
GenF4.menu.pnum.BLACK_F407ZE.upload.maximum_data_size=131072
GenF4.menu.pnum.BLACK_F407ZE.build.board=BLACK_F407ZE
GenF4.menu.pnum.BLACK_F407ZE.build.product_line=STM32F407xx
GenF4.menu.pnum.BLACK_F407ZE.build.variant_h=variant_BLACK_F407XX.h
GenF4.menu.pnum.BLACK_F407ZE.build.variant=STM32F4xx/BLACK_F407XX

# Black F407ZG
# https://github.com/mcauser/BLACK_F407ZG
GenF4.menu.pnum.BLACK_F407ZG=Black F407ZG
GenF4.menu.pnum.BLACK_F407ZG.upload.maximum_size=1048576
GenF4.menu.pnum.BLACK_F407ZG.upload.maximum_data_size=131072
GenF4.menu.pnum.BLACK_F407ZG.build.board=BLACK_F407ZG
GenF4.menu.pnum.BLACK_F407ZG.build.product_line=STM32F407xx
GenF4.menu.pnum.BLACK_F407ZG.build.variant_h=variant_BLACK_F407XX.h
GenF4.menu.pnum.BLACK_F407ZG.build.variant=STM32F4xx/BLACK_F407XX

# Blue F407VE mini: http://wiki.stm32duino.com/index.php?title=Vcc-gnd.com_STM32F407VET6_Mini
GenF4.menu.pnum.BLUE_F407VE_Mini=Blue F407VE mini
GenF4.menu.pnum.BLUE_F407VE_Mini.upload.maximum_size=524288
GenF4.menu.pnum.BLUE_F407VE_Mini.upload.maximum_data_size=131072
GenF4.menu.pnum.BLUE_F407VE_Mini.build.board=BLUE_F407VE_Mini
GenF4.menu.pnum.BLUE_F407VE_Mini.build.product_line=STM32F407xx
GenF4.menu.pnum.BLUE_F407VE_Mini.build.variant_h=variant_{build.board}.h
GenF4.menu.pnum.BLUE_F407VE_Mini.build.variant=STM32F4xx/BLUE_F407VE_Mini

# DIYMORE STM32F407VGT board
GenF4.menu.pnum.DIYMORE_F407VGT=DIYMORE STM32F407VGT
GenF4.menu.pnum.DIYMORE_F407VGT.upload.maximum_size=1048576
GenF4.menu.pnum.DIYMORE_F407VGT.upload.maximum_data_size=131072
GenF4.menu.pnum.DIYMORE_F407VGT.build.board=DIYMORE_F407VGT
GenF4.menu.pnum.DIYMORE_F407VGT.build.product_line=STM32F407xx
GenF4.menu.pnum.DIYMORE_F407VGT.build.variant_h=variant_{build.board}.h
GenF4.menu.pnum.DIYMORE_F407VGT.build.variant=STM32F4xx/DIYMORE_F407VGT

# FK407M1
GenF4.menu.pnum.FK407M1=FK407M1 STM32F407VET
GenF4.menu.pnum.FK407M1.upload.maximum_size=524288
GenF4.menu.pnum.FK407M1.upload.maximum_data_size=131072
GenF4.menu.pnum.FK407M1.build.board=FK407M1
GenF4.menu.pnum.FK407M1.build.product_line=STM32F407xx
GenF4.menu.pnum.FK407M1.build.variant_h=variant_{build.board}.h
GenF4.menu.pnum.FK407M1.build.variant=STM32F4xx/FK407M1

# BlackPill F401CC
GenF4.menu.pnum.BLACKPILL_F401CC=BlackPill F401CC
GenF4.menu.pnum.BLACKPILL_F401CC.upload.maximum_size=262144
GenF4.menu.pnum.BLACKPILL_F401CC.upload.maximum_data_size=65536
GenF4.menu.pnum.BLACKPILL_F401CC.build.board=BLACKPILL_F401CC
GenF4.menu.pnum.BLACKPILL_F401CC.build.product_line=STM32F401xC
GenF4.menu.pnum.BLACKPILL_F401CC.build.variant=STM32F4xx/Generic_F401Cx

# BlackPill F411CE
# https://github.com/mcauser/WEACT_F411CEU6
GenF4.menu.pnum.BLACKPILL_F411CE=BlackPill F411CE
GenF4.menu.pnum.BLACKPILL_F411CE.upload.maximum_size=524288
GenF4.menu.pnum.BLACKPILL_F411CE.upload.maximum_data_size=131072
GenF4.menu.pnum.BLACKPILL_F411CE.build.board=BLACKPILL_F411CE
GenF4.menu.pnum.BLACKPILL_F411CE.build.product_line=STM32F411xE
GenF4.menu.pnum.BLACKPILL_F411CE.build.variant=STM32F4xx/Generic_F411Cx

# Core board F401RCT6
# https://stm32-base.org/boards/STM32F401RCT6-STM32F-Core-Board
GenF4.menu.pnum.CoreBoard_F401RC=Core board F401RCT6
GenF4.menu.pnum.CoreBoard_F401RC.upload.maximum_size=262144
GenF4.menu.pnum.CoreBoard_F401RC.upload.maximum_data_size=65536
GenF4.menu.pnum.CoreBoard_F401RC.build.board=CoreBoard_F401RC
GenF4.menu.pnum.CoreBoard_F401RC.build.product_line=STM32F401xC
GenF4.menu.pnum.CoreBoard_F401RC.build.variant=STM32F4xx/Generic_F401Rx

# Adafruit Feather STM32F405 board
GenF4.menu.pnum.FEATHER_F405=Adafruit Feather STM32F405
GenF4.menu.pnum.FEATHER_F405.upload.maximum_size=1048576
GenF4.menu.pnum.FEATHER_F405.upload.maximum_data_size=131072
GenF4.menu.pnum.FEATHER_F405.build.board=FEATHER_F405
GenF4.menu.pnum.FEATHER_F405.build.product_line=STM32F405xx
GenF4.menu.pnum.FEATHER_F405.build.variant_h=variant_{build.board}.h
GenF4.menu.pnum.FEATHER_F405.build.variant=STM32F4xx/FEATHER_F405

# ThunderPack F411xxE
# https://github.com/jgillick/ThunderPack/tree/STM32F4
GenF4.menu.pnum.THUNDERPACK_F411=ThunderPack v1.1+
GenF4.menu.pnum.THUNDERPACK_F411.upload.maximum_size=524288
GenF4.menu.pnum.THUNDERPACK_F411.upload.maximum_data_size=131072
GenF4.menu.pnum.THUNDERPACK_F411.build.board=THUNDERPACK_F411
GenF4.menu.pnum.THUNDERPACK_F411.build.product_line=STM32F411xE
GenF4.menu.pnum.THUNDERPACK_F411.build.variant_h=variant_{build.board}.h
GenF4.menu.pnum.THUNDERPACK_F411.build.variant=STM32F4xx/THUNDERPACK_F411

# Generic F446RE
GenF4.menu.pnum.Generic_F446RE=Generic F446RE
GenF4.menu.pnum.Generic_F446RE.upload.maximum_size=524288
GenF4.menu.pnum.Generic_F446RE.upload.maximum_data_size=131072
GenF4.menu.pnum.Generic_F446RE.build.board=GENERIC_F446RE
GenF4.menu.pnum.Generic_F446RE.build.product_line=STM32F446xx
GenF4.menu.pnum.Generic_F446RE.build.variant=STM32F4xx/Generic_F446Rx

# Generic F446RC
GenF4.menu.pnum.Generic_F446RC=Generic F446RC
GenF4.menu.pnum.Generic_F446RC.upload.maximum_size=262144
GenF4.menu.pnum.Generic_F446RC.upload.maximum_data_size=131072
GenF4.menu.pnum.Generic_F446RC.build.board=GENERIC_F446RC
GenF4.menu.pnum.Generic_F446RC.build.product_line=STM32F446xx
GenF4.menu.pnum.Generic_F446RC.build.variant=STM32F4xx/Generic_F446Rx

# Generic F423RH
GenF4.menu.pnum.Generic_F423RH=Generic F423RH
GenF4.menu.pnum.Generic_F423RH.upload.maximum_size=1572864
GenF4.menu.pnum.Generic_F423RH.upload.maximum_data_size=327680
GenF4.menu.pnum.Generic_F423RH.build.board=GENERIC_F423RH
GenF4.menu.pnum.Generic_F423RH.build.product_line=STM32F423xx
GenF4.menu.pnum.Generic_F423RH.build.variant=STM32F4xx/Generic_F4x3Rx

# Generic F423CH
GenF4.menu.pnum.Generic_F423CH=Generic F423CH
GenF4.menu.pnum.Generic_F423CH.upload.maximum_size=1572864
GenF4.menu.pnum.Generic_F423CH.upload.maximum_data_size=327680
GenF4.menu.pnum.Generic_F423CH.build.board=GENERIC_F423CH
GenF4.menu.pnum.Generic_F423CH.build.product_line=STM32F423xx
GenF4.menu.pnum.Generic_F423CH.build.variant=STM32F4xx/Generic_F4x3Cx

# Generic F417VG
GenF4.menu.pnum.Generic_F417VG=Generic F417VG
GenF4.menu.pnum.Generic_F417VG.upload.maximum_size=1048576
GenF4.menu.pnum.Generic_F417VG.upload.maximum_data_size=131072
GenF4.menu.pnum.Generic_F417VG.build.board=GENERIC_F417VG
GenF4.menu.pnum.Generic_F417VG.build.product_line=STM32F417xx
GenF4.menu.pnum.Generic_F417VG.build.variant=STM32F4xx/Generic_F4x7Vx

# Generic F417VE
GenF4.menu.pnum.Generic_F417VE=Generic F417VE
GenF4.menu.pnum.Generic_F417VE.upload.maximum_size=524288
GenF4.menu.pnum.Generic_F417VE.upload.maximum_data_size=131072
GenF4.menu.pnum.Generic_F417VE.build.board=GENERIC_F417VE
GenF4.menu.pnum.Generic_F417VE.build.product_line=STM32F417xx
GenF4.menu.pnum.Generic_F417VE.build.variant=STM32F4xx/Generic_F4x7Vx

# Generic F415RG
GenF4.menu.pnum.Generic_F415RG=Generic F415RG
GenF4.menu.pnum.Generic_F415RG.upload.maximum_size=1048576
GenF4.menu.pnum.Generic_F415RG.upload.maximum_data_size=131072
GenF4.menu.pnum.Generic_F415RG.build.board=GENERIC_F415RG
GenF4.menu.pnum.Generic_F415RG.build.product_line=STM32F415xx
GenF4.menu.pnum.Generic_F415RG.build.variant=STM32F4xx/Generic_F4x5RG

