stm32duino/Arduino_Core_STM32/boards.txt
GenFlight.menu.upload_method.bmpMethod=BMP (Black Magic Probe)
GenFlight.menu.upload_method.bmpMethod.upload.protocol=gdb_bmp
GenFlight.menu.upload_method.bmpMethod.upload.tool=bmp_upload

GenFlight.menu.upload_method.hidMethod=HID Bootloader 2.2
GenFlight.menu.upload_method.hidMethod.upload.protocol=hid22
GenFlight.menu.upload_method.hidMethod.upload.tool=hid_upload
GenFlight.menu.upload_method.hidMethod.build.flash_offset=0x800
GenFlight.menu.upload_method.hidMethod.build.bootloader_flags=-DBL_HID -DVECT_TAB_OFFSET={build.flash_offset}

GenFlight.menu.upload_method.dfu2Method=Maple DFU Bootloader 2.0
GenFlight.menu.upload_method.dfu2Method.upload.protocol=maple
GenFlight.menu.upload_method.dfu2Method.upload.tool=maple_upload
GenFlight.menu.upload_method.dfu2Method.upload.usbID=1EAF:0003
GenFlight.menu.upload_method.dfu2Method.upload.altID=2
GenFlight.menu.upload_method.dfu2Method.build.flash_offset=0x2000
GenFlight.menu.upload_method.dfu2Method.build.bootloader_flags=-DBL_LEGACY_LEAF -DVECT_TAB_OFFSET={build.flash_offset}

GenFlight.menu.upload_method.dfuoMethod=Maple DFU Bootloader original
GenFlight.menu.upload_method.dfuoMethod.upload.protocol=maple
GenFlight.menu.upload_method.dfuoMethod.upload.tool=maple_upload
GenFlight.menu.upload_method.dfuoMethod.upload.usbID=1EAF:0003
GenFlight.menu.upload_method.dfuoMethod.upload.altID=1
GenFlight.menu.upload_method.dfuoMethod.build.flash_offset=0x5000
GenFlight.menu.upload_method.dfuoMethod.build.bootloader_flags=-DBL_LEGACY_LEAF -DVECT_TAB_OFFSET={build.flash_offset}

################################################################################
# Garatronic-McHobby STM32 boards

Garatronic.name=Garatronic/McHobby

Garatronic.build.core=arduino
Garatronic.build.board=Garatronic
Garatronic.build.variant_h=variant_{build.board}.h
Garatronic.build.extra_flags=-D{build.product_line} {build.enable_usb} {build.xSerial}

# PYBSTICK26(DUINO) board with F072RB
Garatronic.menu.pnum.PYBSTICK26_DUINO=PYBSTICK26 Duino
Garatronic.menu.pnum.PYBSTICK26_DUINO.upload.maximum_size=131072
Garatronic.menu.pnum.PYBSTICK26_DUINO.upload.maximum_data_size=16384
Garatronic.menu.pnum.PYBSTICK26_DUINO.build.mcu=cortex-m0
Garatronic.menu.pnum.PYBSTICK26_DUINO.build.board=PYBSTICK26_DUINO
Garatronic.menu.pnum.PYBSTICK26_DUINO.build.series=STM32F0xx
Garatronic.menu.pnum.PYBSTICK26_DUINO.build.product_line=STM32F072xB
Garatronic.menu.pnum.PYBSTICK26_DUINO.build.variant=STM32F0xx/F072R8T_F072RB(H-I-T)
Garatronic.menu.pnum.PYBSTICK26_DUINO.build.peripheral_pins=-DCUSTOM_PERIPHERAL_PINS
Garatronic.menu.pnum.PYBSTICK26_DUINO.build.cmsis_lib_gcc=arm_cortexM0l_math

# PYBSTICK26(LITE) board with F401CE
Garatronic.menu.pnum.PYBSTICK26_LITE=PYBSTICK26 Lite
Garatronic.menu.pnum.PYBSTICK26_LITE.upload.maximum_size=524288
Garatronic.menu.pnum.PYBSTICK26_LITE.upload.maximum_data_size=98304
Garatronic.menu.pnum.PYBSTICK26_LITE.build.mcu=cortex-m4
Garatronic.menu.pnum.PYBSTICK26_LITE.build.board=PYBSTICK26_LITE
Garatronic.menu.pnum.PYBSTICK26_LITE.build.series=STM32F4xx
Garatronic.menu.pnum.PYBSTICK26_LITE.build.product_line=STM32F401xE
Garatronic.menu.pnum.PYBSTICK26_LITE.build.variant=STM32F4xx/PYBSTICK26_LITE
Garatronic.menu.pnum.PYBSTICK26_LITE.build.cmsis_lib_gcc=arm_cortexM4lf_math
Garatronic.menu.pnum.PYBSTICK26_LITE.build.flags.fp=-mfpu=fpv4-sp-d16 -mfloat-abi=hard

# PYBSTICK26(STD/Programmez!) board with F411RE
Garatronic.menu.pnum.PYBSTICK26_STD=PYBSTICK26 STD-Programmez
Garatronic.menu.pnum.PYBSTICK26_STD.upload.maximum_size=524288
Garatronic.menu.pnum.PYBSTICK26_STD.upload.maximum_data_size=131072
Garatronic.menu.pnum.PYBSTICK26_STD.build.mcu=cortex-m4
Garatronic.menu.pnum.PYBSTICK26_STD.build.board=PYBSTICK26_STD
Garatronic.menu.pnum.PYBSTICK26_STD.build.series=STM32F4xx
Garatronic.menu.pnum.PYBSTICK26_STD.build.product_line=STM32F411xE
Garatronic.menu.pnum.PYBSTICK26_STD.build.variant=STM32F4xx/PYBSTICK26_STD
Garatronic.menu.pnum.PYBSTICK26_STD.build.cmsis_lib_gcc=arm_cortexM4lf_math
Garatronic.menu.pnum.PYBSTICK26_STD.build.flags.fp=-mfpu=fpv4-sp-d16 -mfloat-abi=hard

# PYBSTICK26(PRO) board with F412RE
Garatronic.menu.pnum.PYBSTICK26_PRO=PYBSTICK26 Pro
Garatronic.menu.pnum.PYBSTICK26_PRO.upload.maximum_size=524288
Garatronic.menu.pnum.PYBSTICK26_PRO.upload.maximum_data_size=262144
Garatronic.menu.pnum.PYBSTICK26_PRO.build.mcu=cortex-m4
Garatronic.menu.pnum.PYBSTICK26_PRO.build.board=PYBSTICK26_PRO
Garatronic.menu.pnum.PYBSTICK26_PRO.build.series=STM32F4xx
Garatronic.menu.pnum.PYBSTICK26_PRO.build.product_line=STM32F412Rx
Garatronic.menu.pnum.PYBSTICK26_PRO.build.variant=STM32F4xx/PYBSTICK26_PRO
Garatronic.menu.pnum.PYBSTICK26_PRO.build.cmsis_lib_gcc=arm_cortexM4lf_math
Garatronic.menu.pnum.PYBSTICK26_PRO.build.flags.fp=-mfpu=fpv4-sp-d16 -mfloat-abi=hard

# PYBSTICK26 boards upload method
Garatronic.menu.upload_method.dfuMethod=STM32CubeProgrammer (DFU)
Garatronic.menu.upload_method.dfuMethod.upload.protocol=2
Garatronic.menu.upload_method.dfuMethod.upload.options=-g
Garatronic.menu.upload_method.dfuMethod.upload.tool=stm32CubeProg

################################################################################
# Midatronics boards

Midatronics.name=Midatronics boards

Midatronics.build.core=arduino
Midatronics.build.board=Midatronics
Midatronics.build.variant_h=variant_{build.board}.h
Midatronics.build.extra_flags=-D{build.product_line} {build.enable_usb} {build.xSerial}

# MKR_SHARKY board
Midatronics.menu.pnum.MKR_SHARKY=MKR Sharky
Midatronics.menu.pnum.MKR_SHARKY.node=NODE_WB55CE
Midatronics.menu.pnum.MKR_SHARKY.upload.maximum_size=262144
Midatronics.menu.pnum.MKR_SHARKY.upload.maximum_data_size=196608
Midatronics.menu.pnum.MKR_SHARKY.build.mcu=cortex-m4
Midatronics.menu.pnum.MKR_SHARKY.build.flags.fp=-mfpu=fpv4-sp-d16 -mfloat-abi=hard
Midatronics.menu.pnum.MKR_SHARKY.build.board=MKR_SHARKY
Midatronics.menu.pnum.MKR_SHARKY.build.series=STM32WBxx
Midatronics.menu.pnum.MKR_SHARKY.build.product_line=STM32WB55xx
Midatronics.menu.pnum.MKR_SHARKY.build.variant=STM32WBxx/WB55C(C-E-G)U
Midatronics.menu.pnum.MKR_SHARKY.build.cmsis_lib_gcc=arm_cortexM4lf_math

# Upload menu
Midatronics.menu.upload_method.MassStorage=Mass Storage
Midatronics.menu.upload_method.MassStorage.upload.protocol=
Midatronics.menu.upload_method.MassStorage.upload.tool=massStorageCopy

